esteban990821/Codigos-Microcontroladores/Pscoc/LABVIEW/labview.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MUX.h"
#include "PGA.h"
#include "ADC.h"
#include "UART.h"
#include "A0_aliases.h"
#include "A0.h"
#include "A1_aliases.h"
#include "A1.h"
#include "A2_aliases.h"
#include "A2.h"
#include "A3_aliases.h"
#include "A3.h"
#include "A4_aliases.h"
#include "A4.h"
#include "A5_aliases.h"
#include "A5.h"
#include "A6_aliases.h"
#include "A6.h"
#include "A7_aliases.h"
#include "A7.h"
#include "isrRx.h"
#include "D0_aliases.h"
#include "D0.h"
#include "D1_aliases.h"
#include "D1.h"
#include "D2_aliases.h"
#include "D2.h"
#include "SalidaD1_aliases.h"
#include "SalidaD1.h"
#include "SalidaD0_aliases.h"
#include "SalidaD0.h"
#include "SalidaD2_aliases.h"
#include "SalidaD2.h"
#include "VDAC2.h"
#include "VDAC1.h"
#include "DAC2_aliases.h"
#include "DAC2.h"
#include "DAC1_aliases.h"
#include "DAC1.h"
#include "timer_clock_2.h"
#include "Counter2.h"
#include "Counter1.h"
#include "timer_clock_1.h"
#include "Pin_1_aliases.h"
#include "Pin_1.h"
#include "Pin_2_aliases.h"
#include "Pin_2.h"
#include "Clock_1.h"
#include "pin2_aliases.h"
#include "pin2.h"
#include "pin1_aliases.h"
#include "pin1.h"
#include "PWM1.h"
#include "PWM0.h"
#include "Clock_2.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

